// ციკლი გამოიტანს ციფრებს 3,2,1 და დასრულდება
var i = 3;

while (i) {
  alert( i-- );
}
// ციკლი გამოიტანს ციფრებს 1,2,3,4 და დასრულდება
var i = 0;
while (++i < 5) alert( i );
// ციკლი გამოიტანს ციფრებს 1,2,3,4,5 და დასრულდება
var i = 0;
while (i++ < 5) alert( i );
// ციკლი გამოიტანს ციფრებს 0,1,2,3,4 და დასრულდება
for (var i = 0; i < 5; i++) alert( i );
// ციკლი გამოიტანს ციფრებს 0,1,2,3,4 და დასრულდება
for (var i = 0; i < 5; ++i) alert( i );
	
// ეკრანზე გამოვა შეტყობინება js
if ("0") {
  alert( 'js' );
}

/*
 ეკრანზე გამოვა შეტყობინება:
 1 თუ რიცხვი 0 ზე მეტია
-1 თუ რიცხვი 0 ნაკლებია
 0 თუ რიცხვი 0 ტოლია
*/

var Num = prompt('შეიყვანეთ ციფრი...');
if (Num > 1) {
	alert(1);
} else if (Num <0) {
	alert(-1);
} else {
	alert(0);
}